GopalSaraf/Practicals/PSDL/include/proc/pic16lf18344.inc
// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 0911h
// bitfield definitions
PMD0_IOCMD_POSN                          equ 0000h
PMD0_IOCMD_POSITION                      equ 0000h
PMD0_IOCMD_SIZE                          equ 0001h
PMD0_IOCMD_LENGTH                        equ 0001h
PMD0_IOCMD_MASK                          equ 0001h
PMD0_CLKRMD_POSN                         equ 0001h
PMD0_CLKRMD_POSITION                     equ 0001h
PMD0_CLKRMD_SIZE                         equ 0001h
PMD0_CLKRMD_LENGTH                       equ 0001h
PMD0_CLKRMD_MASK                         equ 0002h
PMD0_NVMMD_POSN                          equ 0002h
PMD0_NVMMD_POSITION                      equ 0002h
PMD0_NVMMD_SIZE                          equ 0001h
PMD0_NVMMD_LENGTH                        equ 0001h
PMD0_NVMMD_MASK                          equ 0004h
PMD0_FVRMD_POSN                          equ 0006h
PMD0_FVRMD_POSITION                      equ 0006h
PMD0_FVRMD_SIZE                          equ 0001h
PMD0_FVRMD_LENGTH                        equ 0001h
PMD0_FVRMD_MASK                          equ 0040h
PMD0_SYSCMD_POSN                         equ 0007h
PMD0_SYSCMD_POSITION                     equ 0007h
PMD0_SYSCMD_SIZE                         equ 0001h
PMD0_SYSCMD_LENGTH                       equ 0001h
PMD0_SYSCMD_MASK                         equ 0080h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 0912h
// bitfield definitions
PMD1_TMR0MD_POSN                         equ 0000h
PMD1_TMR0MD_POSITION                     equ 0000h
PMD1_TMR0MD_SIZE                         equ 0001h
PMD1_TMR0MD_LENGTH                       equ 0001h
PMD1_TMR0MD_MASK                         equ 0001h
PMD1_TMR1MD_POSN                         equ 0001h
PMD1_TMR1MD_POSITION                     equ 0001h
PMD1_TMR1MD_SIZE                         equ 0001h
PMD1_TMR1MD_LENGTH                       equ 0001h
PMD1_TMR1MD_MASK                         equ 0002h
PMD1_TMR2MD_POSN                         equ 0002h
PMD1_TMR2MD_POSITION                     equ 0002h
PMD1_TMR2MD_SIZE                         equ 0001h
PMD1_TMR2MD_LENGTH                       equ 0001h
PMD1_TMR2MD_MASK                         equ 0004h
PMD1_TMR3MD_POSN                         equ 0003h
PMD1_TMR3MD_POSITION                     equ 0003h
PMD1_TMR3MD_SIZE                         equ 0001h
PMD1_TMR3MD_LENGTH                       equ 0001h
PMD1_TMR3MD_MASK                         equ 0008h
PMD1_TMR4MD_POSN                         equ 0004h
PMD1_TMR4MD_POSITION                     equ 0004h
PMD1_TMR4MD_SIZE                         equ 0001h
PMD1_TMR4MD_LENGTH                       equ 0001h
PMD1_TMR4MD_MASK                         equ 0010h
PMD1_TMR5MD_POSN                         equ 0005h
PMD1_TMR5MD_POSITION                     equ 0005h
PMD1_TMR5MD_SIZE                         equ 0001h
PMD1_TMR5MD_LENGTH                       equ 0001h
PMD1_TMR5MD_MASK                         equ 0020h
PMD1_TMR6MD_POSN                         equ 0006h
PMD1_TMR6MD_POSITION                     equ 0006h
PMD1_TMR6MD_SIZE                         equ 0001h
PMD1_TMR6MD_LENGTH                       equ 0001h
PMD1_TMR6MD_MASK                         equ 0040h
PMD1_NCOMD_POSN                          equ 0007h
PMD1_NCOMD_POSITION                      equ 0007h
PMD1_NCOMD_SIZE                          equ 0001h
PMD1_NCOMD_LENGTH                        equ 0001h
PMD1_NCOMD_MASK                          equ 0080h

// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 0913h
// bitfield definitions
PMD2_CMP1MD_POSN                         equ 0001h
PMD2_CMP1MD_POSITION                     equ 0001h
PMD2_CMP1MD_SIZE                         equ 0001h
PMD2_CMP1MD_LENGTH                       equ 0001h
PMD2_CMP1MD_MASK                         equ 0002h
PMD2_CMP2MD_POSN                         equ 0002h
PMD2_CMP2MD_POSITION                     equ 0002h
PMD2_CMP2MD_SIZE                         equ 0001h
PMD2_CMP2MD_LENGTH                       equ 0001h
PMD2_CMP2MD_MASK                         equ 0004h
PMD2_ADCMD_POSN                          equ 0005h
PMD2_ADCMD_POSITION                      equ 0005h
PMD2_ADCMD_SIZE                          equ 0001h
PMD2_ADCMD_LENGTH                        equ 0001h
PMD2_ADCMD_MASK                          equ 0020h
PMD2_DACMD_POSN                          equ 0006h
PMD2_DACMD_POSITION                      equ 0006h
PMD2_DACMD_SIZE                          equ 0001h
PMD2_DACMD_LENGTH                        equ 0001h
PMD2_DACMD_MASK                          equ 0040h

// Register: PMD3
#define PMD3 PMD3
PMD3                                     equ 0914h
// bitfield definitions
PMD3_CCP1MD_POSN                         equ 0000h
PMD3_CCP1MD_POSITION                     equ 0000h
PMD3_CCP1MD_SIZE                         equ 0001h
PMD3_CCP1MD_LENGTH                       equ 0001h
PMD3_CCP1MD_MASK                         equ 0001h
PMD3_CCP2MD_POSN                         equ 0001h
PMD3_CCP2MD_POSITION                     equ 0001h
PMD3_CCP2MD_SIZE                         equ 0001h
PMD3_CCP2MD_LENGTH                       equ 0001h
PMD3_CCP2MD_MASK                         equ 0002h
PMD3_CCP3MD_POSN                         equ 0002h
PMD3_CCP3MD_POSITION                     equ 0002h
PMD3_CCP3MD_SIZE                         equ 0001h
PMD3_CCP3MD_LENGTH                       equ 0001h
PMD3_CCP3MD_MASK                         equ 0004h
PMD3_CCP4MD_POSN                         equ 0003h
PMD3_CCP4MD_POSITION                     equ 0003h
PMD3_CCP4MD_SIZE                         equ 0001h
PMD3_CCP4MD_LENGTH                       equ 0001h
PMD3_CCP4MD_MASK                         equ 0008h
PMD3_PWM5MD_POSN                         equ 0004h
PMD3_PWM5MD_POSITION                     equ 0004h
PMD3_PWM5MD_SIZE                         equ 0001h
PMD3_PWM5MD_LENGTH                       equ 0001h
PMD3_PWM5MD_MASK                         equ 0010h
PMD3_PWM6MD_POSN                         equ 0005h
PMD3_PWM6MD_POSITION                     equ 0005h
PMD3_PWM6MD_SIZE                         equ 0001h
PMD3_PWM6MD_LENGTH                       equ 0001h
PMD3_PWM6MD_MASK                         equ 0020h
PMD3_CWG1MD_POSN                         equ 0006h
PMD3_CWG1MD_POSITION                     equ 0006h
PMD3_CWG1MD_SIZE                         equ 0001h
PMD3_CWG1MD_LENGTH                       equ 0001h
PMD3_CWG1MD_MASK                         equ 0040h
PMD3_CWG2MD_POSN                         equ 0007h
PMD3_CWG2MD_POSITION                     equ 0007h
PMD3_CWG2MD_SIZE                         equ 0001h
PMD3_CWG2MD_LENGTH                       equ 0001h
PMD3_CWG2MD_MASK                         equ 0080h

// Register: PMD4
#define PMD4 PMD4
PMD4                                     equ 0915h
// bitfield definitions
PMD4_MSSP1MD_POSN                        equ 0001h
PMD4_MSSP1MD_POSITION                    equ 0001h
PMD4_MSSP1MD_SIZE                        equ 0001h
PMD4_MSSP1MD_LENGTH                      equ 0001h
PMD4_MSSP1MD_MASK                        equ 0002h
PMD4_UART1MD_POSN                        equ 0005h
PMD4_UART1MD_POSITION                    equ 0005h
PMD4_UART1MD_SIZE                        equ 0001h
PMD4_UART1MD_LENGTH                      equ 0001h
PMD4_UART1MD_MASK                        equ 0020h

// Register: PMD5
#define PMD5 PMD5
PMD5                                     equ 0916h
// bitfield definitions
PMD5_DSMMD_POSN                          equ 0000h
PMD5_DSMMD_POSITION                      equ 0000h
PMD5_DSMMD_SIZE                          equ 0001h
PMD5_DSMMD_LENGTH                        equ 0001h
PMD5_DSMMD_MASK                          equ 0001h
PMD5_CLC1MD_POSN                         equ 0001h
PMD5_CLC1MD_POSITION                     equ 0001h
PMD5_CLC1MD_SIZE                         equ 0001h
PMD5_CLC1MD_LENGTH                       equ 0001h
PMD5_CLC1MD_MASK                         equ 0002h
PMD5_CLC2MD_POSN                         equ 0002h
PMD5_CLC2MD_POSITION                     equ 0002h
PMD5_CLC2MD_SIZE                         equ 0001h
PMD5_CLC2MD_LENGTH                       equ 0001h
PMD5_CLC2MD_MASK                         equ 0004h
PMD5_CLC3MD_POSN                         equ 0003h
PMD5_CLC3MD_POSITION                     equ 0003h
PMD5_CLC3MD_SIZE                         equ 0001h
PMD5_CLC3MD_LENGTH                       equ 0001h
PMD5_CLC3MD_MASK                         equ 0008h
PMD5_CLC4MD_POSN                         equ 0004h
PMD5_CLC4MD_POSITION                     equ 0004h
PMD5_CLC4MD_SIZE                         equ 0001h
PMD5_CLC4MD_LENGTH                       equ 0001h
PMD5_CLC4MD_MASK                         equ 0010h

