GopalSaraf/Practicals/PSDL/include/proc/pic16lf18344.inc
// Register: CWG2PPS
#define CWG2PPS CWG2PPS
CWG2PPS                                  equ 0E19h
// bitfield definitions
CWG2PPS_CWG2PPS_POSN                     equ 0000h
CWG2PPS_CWG2PPS_POSITION                 equ 0000h
CWG2PPS_CWG2PPS_SIZE                     equ 0005h
CWG2PPS_CWG2PPS_LENGTH                   equ 0005h
CWG2PPS_CWG2PPS_MASK                     equ 001Fh
CWG2PPS_CWG2PPS0_POSN                    equ 0000h
CWG2PPS_CWG2PPS0_POSITION                equ 0000h
CWG2PPS_CWG2PPS0_SIZE                    equ 0001h
CWG2PPS_CWG2PPS0_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS0_MASK                    equ 0001h
CWG2PPS_CWG2PPS1_POSN                    equ 0001h
CWG2PPS_CWG2PPS1_POSITION                equ 0001h
CWG2PPS_CWG2PPS1_SIZE                    equ 0001h
CWG2PPS_CWG2PPS1_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS1_MASK                    equ 0002h
CWG2PPS_CWG2PPS2_POSN                    equ 0002h
CWG2PPS_CWG2PPS2_POSITION                equ 0002h
CWG2PPS_CWG2PPS2_SIZE                    equ 0001h
CWG2PPS_CWG2PPS2_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS2_MASK                    equ 0004h
CWG2PPS_CWG2PPS3_POSN                    equ 0003h
CWG2PPS_CWG2PPS3_POSITION                equ 0003h
CWG2PPS_CWG2PPS3_SIZE                    equ 0001h
CWG2PPS_CWG2PPS3_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS3_MASK                    equ 0008h
CWG2PPS_CWG2PPS4_POSN                    equ 0004h
CWG2PPS_CWG2PPS4_POSITION                equ 0004h
CWG2PPS_CWG2PPS4_SIZE                    equ 0001h
CWG2PPS_CWG2PPS4_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS4_MASK                    equ 0010h

// Register: MDCIN1PPS
#define MDCIN1PPS MDCIN1PPS
MDCIN1PPS                                equ 0E1Ah
// bitfield definitions
MDCIN1PPS_MDCIN1PPS_POSN                 equ 0000h
MDCIN1PPS_MDCIN1PPS_POSITION             equ 0000h
MDCIN1PPS_MDCIN1PPS_SIZE                 equ 0005h
MDCIN1PPS_MDCIN1PPS_LENGTH               equ 0005h
MDCIN1PPS_MDCIN1PPS_MASK                 equ 001Fh
MDCIN1PPS_MDCIN1PPS0_POSN                equ 0000h
MDCIN1PPS_MDCIN1PPS0_POSITION            equ 0000h
MDCIN1PPS_MDCIN1PPS0_SIZE                equ 0001h
MDCIN1PPS_MDCIN1PPS0_LENGTH              equ 0001h
MDCIN1PPS_MDCIN1PPS0_MASK                equ 0001h
MDCIN1PPS_MDCIN1PPS1_POSN                equ 0001h
MDCIN1PPS_MDCIN1PPS1_POSITION            equ 0001h
MDCIN1PPS_MDCIN1PPS1_SIZE                equ 0001h
MDCIN1PPS_MDCIN1PPS1_LENGTH              equ 0001h
MDCIN1PPS_MDCIN1PPS1_MASK                equ 0002h
MDCIN1PPS_MDCIN1PPS2_POSN                equ 0002h
MDCIN1PPS_MDCIN1PPS2_POSITION            equ 0002h
MDCIN1PPS_MDCIN1PPS2_SIZE                equ 0001h
MDCIN1PPS_MDCIN1PPS2_LENGTH              equ 0001h
MDCIN1PPS_MDCIN1PPS2_MASK                equ 0004h
MDCIN1PPS_MDCIN1PPS3_POSN                equ 0003h
MDCIN1PPS_MDCIN1PPS3_POSITION            equ 0003h
MDCIN1PPS_MDCIN1PPS3_SIZE                equ 0001h
MDCIN1PPS_MDCIN1PPS3_LENGTH              equ 0001h
MDCIN1PPS_MDCIN1PPS3_MASK                equ 0008h
MDCIN1PPS_MDCIN1PPS4_POSN                equ 0004h
MDCIN1PPS_MDCIN1PPS4_POSITION            equ 0004h
MDCIN1PPS_MDCIN1PPS4_SIZE                equ 0001h
MDCIN1PPS_MDCIN1PPS4_LENGTH              equ 0001h
MDCIN1PPS_MDCIN1PPS4_MASK                equ 0010h

// Register: MDCIN2PPS
#define MDCIN2PPS MDCIN2PPS
MDCIN2PPS                                equ 0E1Bh
// bitfield definitions
MDCIN2PPS_MDCIN2PPS_POSN                 equ 0000h
MDCIN2PPS_MDCIN2PPS_POSITION             equ 0000h
MDCIN2PPS_MDCIN2PPS_SIZE                 equ 0005h
MDCIN2PPS_MDCIN2PPS_LENGTH               equ 0005h
MDCIN2PPS_MDCIN2PPS_MASK                 equ 001Fh
MDCIN2PPS_MDCIN2PPS0_POSN                equ 0000h
MDCIN2PPS_MDCIN2PPS0_POSITION            equ 0000h
MDCIN2PPS_MDCIN2PPS0_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS0_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS0_MASK                equ 0001h
MDCIN2PPS_MDCIN2PPS1_POSN                equ 0001h
MDCIN2PPS_MDCIN2PPS1_POSITION            equ 0001h
MDCIN2PPS_MDCIN2PPS1_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS1_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS1_MASK                equ 0002h
MDCIN2PPS_MDCIN2PPS2_POSN                equ 0002h
MDCIN2PPS_MDCIN2PPS2_POSITION            equ 0002h
MDCIN2PPS_MDCIN2PPS2_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS2_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS2_MASK                equ 0004h
MDCIN2PPS_MDCIN2PPS3_POSN                equ 0003h
MDCIN2PPS_MDCIN2PPS3_POSITION            equ 0003h
MDCIN2PPS_MDCIN2PPS3_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS3_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS3_MASK                equ 0008h
MDCIN2PPS_MDCIN2PPS4_POSN                equ 0004h
MDCIN2PPS_MDCIN2PPS4_POSITION            equ 0004h
MDCIN2PPS_MDCIN2PPS4_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS4_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS4_MASK                equ 0010h

// Register: MDMINPPS
#define MDMINPPS MDMINPPS
MDMINPPS                                 equ 0E1Ch
// bitfield definitions
MDMINPPS_MDMINPPS_POSN                   equ 0000h
MDMINPPS_MDMINPPS_POSITION               equ 0000h
MDMINPPS_MDMINPPS_SIZE                   equ 0005h
MDMINPPS_MDMINPPS_LENGTH                 equ 0005h
MDMINPPS_MDMINPPS_MASK                   equ 001Fh
MDMINPPS_MDMINPPS0_POSN                  equ 0000h
MDMINPPS_MDMINPPS0_POSITION              equ 0000h
MDMINPPS_MDMINPPS0_SIZE                  equ 0001h
MDMINPPS_MDMINPPS0_LENGTH                equ 0001h
MDMINPPS_MDMINPPS0_MASK                  equ 0001h
MDMINPPS_MDMINPPS1_POSN                  equ 0001h
MDMINPPS_MDMINPPS1_POSITION              equ 0001h
MDMINPPS_MDMINPPS1_SIZE                  equ 0001h
MDMINPPS_MDMINPPS1_LENGTH                equ 0001h
MDMINPPS_MDMINPPS1_MASK                  equ 0002h
MDMINPPS_MDMINPPS2_POSN                  equ 0002h
MDMINPPS_MDMINPPS2_POSITION              equ 0002h
MDMINPPS_MDMINPPS2_SIZE                  equ 0001h
MDMINPPS_MDMINPPS2_LENGTH                equ 0001h
MDMINPPS_MDMINPPS2_MASK                  equ 0004h
MDMINPPS_MDMINPPS3_POSN                  equ 0003h
MDMINPPS_MDMINPPS3_POSITION              equ 0003h
MDMINPPS_MDMINPPS3_SIZE                  equ 0001h
MDMINPPS_MDMINPPS3_LENGTH                equ 0001h
MDMINPPS_MDMINPPS3_MASK                  equ 0008h
MDMINPPS_MDMINPPS4_POSN                  equ 0004h
MDMINPPS_MDMINPPS4_POSITION              equ 0004h
MDMINPPS_MDMINPPS4_SIZE                  equ 0001h
MDMINPPS_MDMINPPS4_LENGTH                equ 0001h
MDMINPPS_MDMINPPS4_MASK                  equ 0010h

